In [1]:
import pandas as pd

# Creating a simple DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [24, 27, 22, 32],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston']
}

df = pd.DataFrame(data)

print(df)

      Name  Age         City
0    Alice   24     New York
1      Bob   27  Los Angeles
2  Charlie   22      Chicago
3    David   32      Houston

In [2]:
# Selecting a column
ages = df['Age']
print(ages)

# Selecting multiple columns
subset = df[['Name', 'City']]
print(subset)

# Filtering rows based on a condition
filtered_df = df[df['Age'] > 25]
print(filtered_df)

0    24
1    27
2    22
3    32
Name: Age, dtype: int64
      Name         City
0    Alice     New York
1      Bob  Los Angeles
2  Charlie      Chicago
3    David      Houston
    Name  Age         City
1    Bob   27  Los Angeles
3  David   32      Houston

In [3]:
# Grouping by a column and calculating the mean of another column
grouped_df = df.groupby('City')['Age'].mean()
print(grouped_df)

City
Chicago        22.0
Houston        32.0
Los Angeles    27.0
New York       24.0
Name: Age, dtype: float64

In [4]:
# Checking for missing data
print(df.isnull().sum())

# Dropping rows with missing data
df_cleaned = df.dropna()

# Filling missing data with a specific value
df_filled = df.fillna(0)

Name    0
Age     0
City    0
dtype: int64

In [6]:
# Creating another DataFrame for merging
data2 = {
    'Name': ['Alice', 'Bob', 'Charlie', 'Eve'],
    'Salary': [50000, 60000, 55000, 70000]
}

df2 = pd.DataFrame(data2)

# Merging DataFrames on a common column
merged_df = pd.merge(df, df2, on='Name', how='inner')
print(merged_df)

      Name  Age         City  Salary
0    Alice   24     New York   50000
1      Bob   27  Los Angeles   60000
2  Charlie   22      Chicago   55000

In [7]:
# Applying a custom function to a column
df['Age_Squared'] = df['Age'].apply(lambda x: x ** 2)
print(df)

      Name  Age         City  Age_Squared
0    Alice   24     New York          576
1      Bob   27  Los Angeles          729
2  Charlie   22      Chicago          484
3    David   32      Houston         1024